# Linux commands
# strl + alt + T -> Команда открытия терминала

# ~ - символ домашней дериктории
# / -> символ корневой директории(root)

# . -> обозначает текущую дерикторию
# .. -> обозначает предыдущию дерикторию

# 1. ls -> для вывода списка всех дерикторий и файлов в текущей директории в терминале
# ls, ls Desktop, ls ~/Desktop

# 2. cd - команда для перехода из одной директории в другую

# 3. mkdir - создает директорию

#  4. touch - создает файл

# 5. rmdir - удаляет пустую директорию

# 6. rm - удаляет файл

# 7. rm -rf - удаляет вообще все (принудительное удаление)

# 8. cat - Показывает содержание файла

# 9.nano - открывает файл для редактирования в графическом интерфейсе Нано
#     если нет файла, то нано создаст новый



