# GIT - распределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов, в вашем проекте. При помощи распределенности git еще и организовывается командная работа.


# Репозиторий - это хранилище вашего кода и истории его изменений

#------#------#------#------#------#------#------#------#------#------

# GitHub - веб сайт дя размещения git-репозиториев в совместной разработке проектов

#------#------#------#------#------#------#------#------#------#------
# Команды GIT:
# 1. git init -> она создает локальный гит репозиторий у вас на ПК, в той директории в которой была прописана команда.

# 2. git status -> команда для проверки статуса наших файлов

# 3. git add -> команда для добавления файлов в систему отслеживания гита, после этой команды изменения начинают фиксироваться

# 4. git commit -m 'comment' -> команда для сохранения версии в локальном репозиотории, вместе с комментарием к изменениям

# 5. git remote add origin <url> -> это команда для того чтобы установить связь локального репозитория с удаленным в гитхабе

# 6. git push -> команда для отправки ваших изменений в локальном репо в удаленный репо
         #git push origin main